; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=156, out_folder=./training, instance_id=12, seed=2036, goal_proportion=0.03

(define (problem blocksworld-12)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 - object)
 (:init 
    (arm-empty)
    (clear b77)
    (on b77 b116)
    (on b116 b148)
    (on b148 b39)
    (on-table b39)
    (clear b94)
    (on b94 b87)
    (on b87 b107)
    (on b107 b88)
    (on b88 b57)
    (on b57 b83)
    (on b83 b117)
    (on b117 b156)
    (on b156 b65)
    (on b65 b123)
    (on-table b123)
    (clear b155)
    (on b155 b24)
    (on b24 b25)
    (on b25 b86)
    (on b86 b140)
    (on b140 b70)
    (on-table b70)
    (clear b133)
    (on b133 b53)
    (on-table b53)
    (clear b47)
    (on b47 b13)
    (on-table b13)
    (clear b104)
    (on-table b104)
    (clear b55)
    (on b55 b78)
    (on b78 b42)
    (on b42 b67)
    (on-table b67)
    (clear b93)
    (on-table b93)
    (clear b11)
    (on-table b11)
    (clear b64)
    (on b64 b85)
    (on b85 b132)
    (on b132 b50)
    (on b50 b125)
    (on b125 b31)
    (on-table b31)
    (clear b144)
    (on b144 b76)
    (on b76 b150)
    (on-table b150)
    (clear b3)
    (on b3 b92)
    (on b92 b29)
    (on b29 b130)
    (on b130 b6)
    (on b6 b9)
    (on-table b9)
    (clear b84)
    (on-table b84)
    (clear b44)
    (on b44 b12)
    (on b12 b136)
    (on b136 b30)
    (on b30 b146)
    (on-table b146)
    (clear b72)
    (on b72 b119)
    (on b119 b109)
    (on b109 b49)
    (on b49 b121)
    (on b121 b115)
    (on b115 b60)
    (on b60 b17)
    (on b17 b113)
    (on b113 b18)
    (on b18 b111)
    (on b111 b48)
    (on b48 b134)
    (on-table b134)
    (clear b75)
    (on b75 b139)
    (on b139 b28)
    (on b28 b122)
    (on b122 b120)
    (on-table b120)
    (clear b142)
    (on b142 b51)
    (on b51 b36)
    (on b36 b97)
    (on b97 b10)
    (on b10 b22)
    (on b22 b95)
    (on b95 b80)
    (on b80 b89)
    (on-table b89)
    (clear b99)
    (on b99 b71)
    (on b71 b101)
    (on-table b101)
    (clear b127)
    (on b127 b45)
    (on-table b45)
    (clear b27)
    (on b27 b135)
    (on b135 b33)
    (on-table b33)
    (clear b124)
    (on b124 b16)
    (on b16 b32)
    (on b32 b91)
    (on b91 b149)
    (on b149 b114)
    (on b114 b131)
    (on b131 b79)
    (on b79 b63)
    (on-table b63)
    (clear b81)
    (on b81 b74)
    (on b74 b153)
    (on-table b153)
    (clear b34)
    (on b34 b137)
    (on-table b137)
    (clear b58)
    (on b58 b56)
    (on b56 b96)
    (on b96 b90)
    (on b90 b143)
    (on-table b143)
    (clear b103)
    (on b103 b69)
    (on b69 b108)
    (on b108 b118)
    (on-table b118)
    (clear b7)
    (on b7 b128)
    (on-table b128)
    (clear b66)
    (on-table b66)
    (clear b129)
    (on b129 b61)
    (on b61 b62)
    (on-table b62)
    (clear b68)
    (on b68 b46)
    (on b46 b82)
    (on-table b82)
    (clear b2)
    (on b2 b1)
    (on b1 b52)
    (on b52 b26)
    (on b26 b14)
    (on-table b14)
    (clear b38)
    (on b38 b21)
    (on b21 b73)
    (on b73 b100)
    (on b100 b37)
    (on b37 b19)
    (on-table b19)
    (clear b152)
    (on-table b152)
    (clear b112)
    (on b112 b59)
    (on-table b59)
    (clear b43)
    (on b43 b138)
    (on b138 b40)
    (on b40 b54)
    (on b54 b41)
    (on-table b41)
    (clear b105)
    (on b105 b23)
    (on b23 b126)
    (on b126 b145)
    (on b145 b110)
    (on-table b110)
    (clear b8)
    (on b8 b20)
    (on b20 b98)
    (on b98 b102)
    (on b102 b5)
    (on b5 b141)
    (on b141 b35)
    (on b35 b4)
    (on b4 b106)
    (on b106 b151)
    (on b151 b147)
    (on b147 b154)
    (on b154 b15)
    (on-table b15))
 (:goal  (and 
    (clear b1)
    (on b1 b3)
    (on-table b3)
    (clear b2)
    (on b2 b4)
    (on-table b4))))

; plan
1. (unstack b3 b92)
   deleted: (on b3 b92) (clear b3) (arm-empty)
   added: (holding b3) (clear b92)
   goals met: 1 of 6
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 6
3. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 2 of 6
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 6
5. (unstack b20 b98)
   deleted: (on b20 b98) (clear b20) (arm-empty)
   added: (holding b20) (clear b98)
   goals met: 2 of 6
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 6
7. (unstack b98 b102)
   deleted: (on b98 b102) (clear b98) (arm-empty)
   added: (holding b98) (clear b102)
   goals met: 2 of 6
8. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 2 of 6
9. (unstack b102 b5)
   deleted: (on b102 b5) (clear b102) (arm-empty)
   added: (holding b102) (clear b5)
   goals met: 2 of 6
10. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 2 of 6
11. (unstack b5 b141)
   deleted: (on b5 b141) (clear b5) (arm-empty)
   added: (holding b5) (clear b141)
   goals met: 2 of 6
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 6
13. (unstack b141 b35)
   deleted: (on b141 b35) (clear b141) (arm-empty)
   added: (holding b141) (clear b35)
   goals met: 2 of 6
14. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 2 of 6
15. (unstack b35 b4)
   deleted: (on b35 b4) (clear b35) (arm-empty)
   added: (holding b35) (clear b4)
   goals met: 2 of 6
16. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 2 of 6
17. (unstack b4 b106)
   deleted: (on b4 b106) (clear b4) (arm-empty)
   added: (holding b4) (clear b106)
   goals met: 2 of 6
18. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 6
19. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 3 of 6
20. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 5 of 6
21. (unstack b1 b52)
   deleted: (on b1 b52) (clear b1) (arm-empty)
   added: (holding b1) (clear b52)
   goals met: 4 of 6
22. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 6 of 6
